<template>
  <div>

    <el-row :gutter="gutter">

      <el-col :span="span"
              v-for="(item,key) in items"
              :key="key">

        <el-popover
          placement="bottom"
          :title="item.title"
          width="400"
          trigger="click"
          :content="item.content">
          <el-button slot="reference">{{item.title}}</el-button>
        </el-popover>

      </el-col>
    </el-row>
  </div>
</template>

<script>
  export default {
    name: "AnalyzePopover",
    data() {
      return {
        gutter: 20,
        span: 3,
        items: [
          {
            title: "车辆损失险",
            content: "车辆损失险是车辆保险中用途最广泛的险种，它负责赔偿由于自然灾害和意外事故造成的自己车辆的损失。无论是小剐小蹭，还是损坏严重，都可以由保险公司来支付修理费用。\n" +
              "    被保险人或其允许的合格驾驶员在使用保险车辆过程中，因下列原因造成保险车辆的损失，保险公司负责赔偿：1．碰撞、倾覆；2．火灾、爆炸；3．外界物体倒塌、空中运行物体坠落、保险车辆行驶中平行坠落；4．雷击、暴风、龙卷风、暴雨、洪水、海啸、地陷、冰陷、崖崩、雪崩、雹灾、泥石流、滑坡；5. 载运保险车辆的渡船遭受自然灾害（只限于有驾驶员随车照料者）。\n" +
              "    发生保险事故时，被保险人或其允许的合格驾驶员对保险车辆采取施救、保护措施所支出的合理费用，保险公司负责赔偿。但此项费用的最高赔偿金额以责任限额为限。"
          },
          {
            title: "全车盗抢险",
            content: "指保险车辆全车被盗窃、被抢劫、被抢夺，经县级以上公安刑侦部门立案侦查证实满一定时间没有下落的，由保险公司在保险金额内予以赔偿。如果是车辆的某些零部件被盗抢，如轮胎被盗抢、车内财产被盗抢、后备箱内的物品丢失，保险公司均不负责赔偿。 但是，对于车辆被盗抢期间内，保险车辆上零部件的损坏、丢失，保险公司一般负责赔偿。\n" +
              "    全车盗抢险为附加险，必须在投保车辆损失险之后方可投保该险种。"
          },
          {
            title: "玻璃单独破碎险",
            content: "负责赔偿保险车辆在使用过程中，发生本车玻璃发生单独破碎的保险公司按照保险合同进行赔偿。玻璃单独破碎险中的玻璃是指风档玻璃和车窗玻璃，如果车灯、车镜玻璃破碎及车辆维修过程中造成的破碎，保险公司不承担赔偿责任。\n" +
              "    玻璃单独破碎险为附加险，必须在投保车辆损失险之后方可投保该险种。"
          },
          {
            title: "自燃损失险",
            content: "负责赔偿因本车电器、线路、供油系统发生故障及运载货物自身原因起火造成车辆本身的损失。当车辆发生部分损失，按照实际修复费用赔偿修理费。如果车辆自燃造成整体烧毁或已经失去修理价值，则按照出险时车辆的实际价值赔偿，但不超过责任限额。"
          },
          {
            title: "车上人员责任险",
            content: "保险车辆发生意外事故导致车上司机或乘客人员伤亡造成的费用损失，以及为减少损失而支付的必要合理的施救、保护费用，由保险公司承担赔偿责任。"
          },
        ]
      };
    }
  }
</script>
